Revit 2026 API

# ElectricalSystemStartSlot Property

---

The Start Slot where the Electrical System is located in its panel.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int StartSlot { get; }
```
```vb
Public ReadOnly Property StartSlot As Integer
	Get
```
```cpp
public:
property int StartSlot {
	int get ();
}
```
```fsharp
member StartSlot : int with get
```

#### Property Value

Int32

This property is used to retrieve the Start Slot of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace